# This file manages all the applications on a mac. Its used by bootstrap.sh
# For syntax go to https://github.com/Homebrew/homebrew-bundle

tap "cantino/mcfly"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/services"
tap "microsoft/mssql-release"

# bash 4
brew "bash"
# version control
brew "git"
# command line fuzzy finder
brew "fzf"
# faster find
brew "fd"
# code search
brew "ag"
# faster grep
brew "ripgrep"
# set default apps
brew "duti"
# store images in git
brew "git-lfs"
# sign commits
brew "gpg"
# cli for github api
brew "hub"
# dot file manager
brew "yadm"
# latest zsh
brew "zsh"
# jump around the terminal
brew "zoxide"
# synchronize setting files
brew "mackup"
# node (and npm)
brew "node"
# gpg for signing commits
brew "gnupg"
# pin-entry for logging into gpg
brew "pinentry-mac"
# tmux for terminals
brew "tmux"
# mac app store manager
brew "mas"
# image processing cli
brew "imagemagick"
# manipulate json with the cli
brew "jq"
# send notifications from the terminal
brew "terminal-notifier"
# containers
brew "docker-compose"
# svn for fonts
brew "svn"
# display directories as trees
brew "tree"
# alternative to cat
brew "bat"
# gnu coreutils useful for scripts
brew "coreutils"
# git diff viewer
brew "git-delta"
# version manager
brew "asdf"
# ffmpeg for transforming videos
# args from https://gist.github.com/Vestride/278e13915894821e1d6f
brew "ffmpeg"
# shell search that uses a neural network
brew "mcfly"
# terminal spotify player
brew "spotify-tui"
# background spotify daemon (broken until https://github.com/Spotifyd/spotifyd/issues/719 is resolved)
brew "spotifyd", restart_service: :changed
# interapplication messaging system
brew "dbus", restart_service: :changed
# rust lang
brew "rust"
# manage compile and link flags for libraries
brew "pkg-config"
# compile documents
brew "pandoc"
# references for figures in pandoc markdown
brew "pandoc-crossref"
# download youtube videos
brew "youtube-dl"
# community driven man pages
brew "tldr"
# ripgrep in rich documents
brew "rga"
# extract text from pdfs for rga
brew "poppler"
# bitwarden cli
brew "bitwarden-cli"
# delete files with a cli
brew "ncdu"
# access mysql
brew "mysql-client"
# paste images into files like pbpaste for text
brew "pngpaste"
# driver for connecting to sql server
brew "msodbcsql17"
# old openssl for msodbcsql17 bug
brew "openssl@1.1"
# php for spotify mini
brew "php"
# faster and smarter cd command written in rust
brew "zoxide"
# nicer version of ls
brew "lsd"

# automation and search
cask "alfred"
# learning
cask "anki"
# backups
cask "backblaze"
# great software for creating bootable usbs (always forget what this is called)
cask "balenaetcher"
# developer documentation
cask "dash"
# sql client
cask "datagrip"
# autocomplete for the terminal
cask "fig"
# less blue light at night
cask "flux"
# browser
cask "google-chrome"
# screen recording
cask "kap"
# terminal
cask "kitty"
# keyboard window management
cask "rectangle"
# time tracking
cask "rescuetime"
# communicaiton
cask "slack"
# music
cask "spotify"
# editor
cask "visual-studio-code"
# watch videos
cask "vlc"
# communication (zoom)
cask "zoom"
# reference manager
cask "zotero"
# mac window manager scripting
cask "phoenix"
# containers
cask "docker"
# editor font
cask "font-roboto-mono-for-powerline"
# hide menu bar icons
cask "vanilla"
# control monitor brightness
cask "monitorcontrol"
# access local host on browserstack
cask "browserstacklocal"
# vms for testing ie11
cask "vmware-fusion"
# sqlite db browser
cask "db-browser-for-sqlite"
# free password manager
cask "bitwarden"
# alternative browser
cask "firefox"
# prototyping application
cask "figma"
# gui for mysql
cask "mysqlworkbench"
# a better gui for mysql
cask "sequel-ace"

# simpler bluetooth connections
mas "Toothfairy", id: 1191449274
# add block for safari
mas "AdGuard for Safari", id: 1440147259
